{"title": "Asylum Act of 26 June 1998 (AsylA)", "jurisdiction": "SWISS", "language": "ENG", "article_number": "Art. 1", "text": "This Act regulates:a. the granting of asylum and the legal status of refugees in Switzerland;b. the temporary protection of persons in need of protection in Switzerland and their return.", "id": "67c9c559-1ec9-461c-9e86-91de1ee5a7f7"}
{"title": "Asylum Act of 26 June 1998 (AsylA)", "jurisdiction": "SWISS", "language": "ENG", "article_number": "Art. 2 para. 1", "text": "In response to an application, Switzerland grants asylum to refugees in accordance with this Act.", "id": "355ce413-1299-4297-9e21-4b39fbc5b879"}
{"title": "Asylum Act of 26 June 1998 (AsylA)", "jurisdiction": "SWISS", "language": "ENG", "article_number": "Art. 2 para. 2", "text": "Asylum includes the protection and the legal status granted in Switzerland to persons on the basis of their refugee status.", "id": "9e7516db-5b0a-4609-a0cf-b16d34965b82"}
{"title": "Asylum Act of 26 June 1998 (AsylA)", "jurisdiction": "SWISS", "language": "ENG", "article_number": "Art. 3 para. 1", "text": "Refugees are persons who in their native country or in their country of last residence are subject to serious disadvantages or have a well-founded fear of being exposed to such disadvantages for reasons of race, religion, nationality, membership of a particular social group or due to their political opinions.", "id": "e99b02e2-03d5-4e86-93f0-87ce8a7f9c77"}
{"title": "Asylum Act of 26 June 1998 (AsylA)", "jurisdiction": "SWISS", "language": "ENG", "article_number": "Art. 3 para. 2", "text": "Serious disadvantages include a threat to life, physical integrity or freedom as well as measures that exert intolerable psychological pressure. Motives for seeking asylum specific to women must be taken into account.", "id": "45a45367-180e-4739-9efd-5a107e033b6d"}
{"title": "Asylum Act of 26 June 1998 (AsylA)", "jurisdiction": "SWISS", "language": "ENG", "article_number": "Art. 3 para. 3", "text": "Persons who are subject to serious disadvantages or have a well-founded fear of being exposed to such disadvantages because they have refused to perform military service or have deserted are not refugees. The provisions of the Convention of 28 July 1951 relating to the Status of Refugees are reserved.", "id": "01356595-6943-4f11-8af9-2f07aafa8aef"}
{"title": "Asylum Act of 26 June 1998 (AsylA)", "jurisdiction": "SWISS", "language": "ENG", "article_number": "Art. 3 para. 4", "text": "Persons who claim grounds based on their conduct following their departure that are neither an expression nor a continuation of a conviction already held in their native country or country of origin are not refugees. The provisions of the Convention of Refugee Convention are reserved.", "id": "5db2928b-f4e4-40bc-85e4-e3448b2a24ba"}
{"title": "Asylum Act of 26 June 1998 (AsylA)", "jurisdiction": "SWISS", "language": "ENG", "article_number": "Art. 4", "text": "Switzerland may grant temporary protection to persons in need of protection as long as they are exposed to a serious general danger, in particular during a war or civil war as well as in situations of general violence.", "id": "755b4884-e4b5-47aa-a1d6-f58a9584f533"}
{"title": "Asylum Act of 26 June 1998 (AsylA)", "jurisdiction": "SWISS", "language": "ENG", "article_number": "Art. 5 para. 1", "text": "No person may be forced in any way to return to a country where their life, physical integrity or freedom are threatened on any of the grounds stated in Article 3 paragraph 1 or where they would be at risk of being forced to return to such a country.", "id": "e727685c-362b-44bd-abf2-c202e08adfa2"}
{"title": "Asylum Act of 26 June 1998 (AsylA)", "jurisdiction": "SWISS", "language": "ENG", "article_number": "Art. 5 para. 2", "text": "The ban on refoulement may not be invoked if there are substantial grounds for the assumption that, because the person invoking it has a legally binding conviction for a particularly serious felony or misdemeanour, they represent a threat to Switzerland’s security or are to be considered dangerous to the public.", "id": "63ebb820-d4ca-4116-99bf-5e348f4ef317"}
